# Pandas Essentials

## Pandas Series

In [1]:
import numpy as np
import pandas as pd

In [2]:
my_label = ['x', 'y', 'z']
my_data = [100, 200, 300]

In [3]:
pd.Series(data=my_data)

0    100
1    200
2    300
dtype: int64

In [4]:
pd.Series(data=my_data, index=my_label)

x    100
y    200
z    300
dtype: int64

In [5]:
my_array = np.array(my_data)

In [6]:
my_array

array([100, 200, 300])

In [7]:
my_dict = {'x':100, 'y':200, 'z':300}

In [8]:
my_dict

{'x': 100, 'y': 200, 'z': 300}

In [9]:
pd.Series(my_dict)

x    100
y    200
z    300
dtype: int64

In [10]:
dic_1 = {'Toronto': 500, 'Calgary': 200, 'Vancouver': 300, 'Montreal': 700}
dic_2 = {'Calgary': 200, 'Vancouver': 300, 'Montreal': 700}
dic_3 = {'Calgary': 200, 'Vancouver': 300, 'Montreal': 700, 'Jasper': 1000}

In [11]:
ser_1 = pd.Series(dic_1)
ser_2 = pd.Series(dic_2)
ser_3 = pd.Series(dic_3)

In [12]:
ser_1

Toronto      500
Calgary      200
Vancouver    300
Montreal     700
dtype: int64

In [13]:
ser_1['Toronto']

500

In [14]:
ser_1 + ser_2

Calgary       400.0
Montreal     1400.0
Toronto         NaN
Vancouver     600.0
dtype: float64

In [15]:
ser_4 = ser_1 + ser_2
ser_4

Calgary       400.0
Montreal     1400.0
Toronto         NaN
Vancouver     600.0
dtype: float64

In [16]:
ser_4.isnull()

Calgary      False
Montreal     False
Toronto       True
Vancouver    False
dtype: bool

In [17]:
ser_4.notnull()

Calgary       True
Montreal      True
Toronto      False
Vancouver     True
dtype: bool

In [18]:
ser_4.axes

[Index(['Calgary', 'Montreal', 'Toronto', 'Vancouver'], dtype='object')]

In [19]:
ser_4.values

array([ 400., 1400.,   nan,  600.])

In [20]:
ser_4.head(2)

Calgary      400.0
Montreal    1400.0
dtype: float64

In [21]:
ser_4.tail(2)

Toronto        NaN
Vancouver    600.0
dtype: float64

In [22]:
ser_4.size

4

In [23]:
ser_4.empty

False

## Pandas Dataframe Structure

In [24]:
index = 'r1 r2 r3 r4 r5 r6 r7 r8 r9 r10'.split()
cols = 'c1 c2 c3 c4 c5 c6 c7 c8 c9 c10'.split()
array_2d = np.arange(0, 100).reshape(10, 10)

In [25]:
index

['r1', 'r2', 'r3', 'r4', 'r5', 'r6', 'r7', 'r8', 'r9', 'r10']

In [26]:
cols

['c1', 'c2', 'c3', 'c4', 'c5', 'c6', 'c7', 'c8', 'c9', 'c10']

In [27]:
array_2d

array([[ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14, 15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24, 25, 26, 27, 28, 29],
       [30, 31, 32, 33, 34, 35, 36, 37, 38, 39],
       [40, 41, 42, 43, 44, 45, 46, 47, 48, 49],
       [50, 51, 52, 53, 54, 55, 56, 57, 58, 59],
       [60, 61, 62, 63, 64, 65, 66, 67, 68, 69],
       [70, 71, 72, 73, 74, 75, 76, 77, 78, 79],
       [80, 81, 82, 83, 84, 85, 86, 87, 88, 89],
       [90, 91, 92, 93, 94, 95, 96, 97, 98, 99]])

In [28]:
df = pd.DataFrame(data=array_2d, index=index, columns=cols)

In [29]:
df

     c1  c2  c3  c4  c5  c6  c7  c8  c9  c10
r1    0   1   2   3   4   5   6   7   8    9
r2   10  11  12  13  14  15  16  17  18   19
r3   20  21  22  23  24  25  26  27  28   29
r4   30  31  32  33  34  35  36  37  38   39
r5   40  41  42  43  44  45  46  47  48   49
r6   50  51  52  53  54  55  56  57  58   59
r7   60  61  62  63  64  65  66  67  68   69
r8   70  71  72  73  74  75  76  77  78   79
r9   80  81  82  83  84  85  86  87  88   89
r10  90  91  92  93  94  95  96  97  98   99

In [30]:
df['c1']

r1      0
r2     10
r3     20
r4     30
r5     40
r6     50
r7     60
r8     70
r9     80
r10    90
Name: c1, dtype: int64

In [31]:
type(df['c1'])

pandas.core.series.Series

In [32]:
df[['c1', 'c2']]

     c1  c2
r1    0   1
r2   10  11
r3   20  21
r4   30  31
r5   40  41
r6   50  51
r7   60  61
r8   70  71
r9   80  81
r10  90  91

In [33]:
type(df[['c1', 'c2']])

pandas.core.frame.DataFrame

In [34]:
df

     c1  c2  c3  c4  c5  c6  c7  c8  c9  c10
r1    0   1   2   3   4   5   6   7   8    9
r2   10  11  12  13  14  15  16  17  18   19
r3   20  21  22  23  24  25  26  27  28   29
r4   30  31  32  33  34  35  36  37  38   39
r5   40  41  42  43  44  45  46  47  48   49
r6   50  51  52  53  54  55  56  57  58   59
r7   60  61  62  63  64  65  66  67  68   69
r8   70  71  72  73  74  75  76  77  78   79
r9   80  81  82  83  84  85  86  87  88   89
r10  90  91  92  93  94  95  96  97  98   99

In [35]:
df['new'] = df['c1'] + df['c2']

In [36]:
df

     c1  c2  c3  c4  c5  c6  c7  c8  c9  c10  new
r1    0   1   2   3   4   5   6   7   8    9    1
r2   10  11  12  13  14  15  16  17  18   19   21
r3   20  21  22  23  24  25  26  27  28   29   41
r4   30  31  32  33  34  35  36  37  38   39   61
r5   40  41  42  43  44  45  46  47  48   49   81
r6   50  51  52  53  54  55  56  57  58   59  101
r7   60  61  62  63  64  65  66  67  68   69  121
r8   70  71  72  73  74  75  76  77  78   79  141
r9   80  81  82  83  84  85  86  87  88   89  161
r10  90  91  92  93  94  95  96  97  98   99  181

In [37]:
df.drop('new', axis=1, inplace=True)
df

     c1  c2  c3  c4  c5  c6  c7  c8  c9  c10
r1    0   1   2   3   4   5   6   7   8    9
r2   10  11  12  13  14  15  16  17  18   19
r3   20  21  22  23  24  25  26  27  28   29
r4   30  31  32  33  34  35  36  37  38   39
r5   40  41  42  43  44  45  46  47  48   49
r6   50  51  52  53  54  55  56  57  58   59
r7   60  61  62  63  64  65  66  67  68   69
r8   70  71  72  73  74  75  76  77  78   79
r9   80  81  82  83  84  85  86  87  88   89
r10  90  91  92  93  94  95  96  97  98   99

In [38]:
df.loc['r1']

c1     0
c2     1
c3     2
c4     3
c5     4
c6     5
c7     6
c8     7
c9     8
c10    9
Name: r1, dtype: int64

In [39]:
df.iloc[0]

c1     0
c2     1
c3     2
c4     3
c5     4
c6     5
c7     6
c8     7
c9     8
c10    9
Name: r1, dtype: int64

In [40]:
df.loc[['r1', 'r2']]

    c1  c2  c3  c4  c5  c6  c7  c8  c9  c10
r1   0   1   2   3   4   5   6   7   8    9
r2  10  11  12  13  14  15  16  17  18   19

In [41]:
df.loc['r1', 'c1']

0

In [42]:
df.loc[['r1', 'r2'], ['c1', 'c2']]

    c1  c2
r1   0   1
r2  10  11

In [43]:
bool_mask  = df % 3 == 0

In [44]:
bool_mask

        c1     c2     c3     c4     c5     c6     c7     c8     c9    c10
r1    True  False  False   True  False  False   True  False  False   True
r2   False  False   True  False  False   True  False  False   True  False
r3   False   True  False  False   True  False  False   True  False  False
r4    True  False  False   True  False  False   True  False  False   True
r5   False  False   True  False  False   True  False  False   True  False
r6   False   True  False  False   True  False  False   True  False  False
r7    True  False  False   True  False  False   True  False  False   True
r8   False  False   True  False  False   True  False  False   True  False
r9   False   True  False  False   True  False  False   True  False  False
r10   True  False  False   True  False  False   True  False  False   True

In [45]:
df[bool_mask]

       c1    c2    c3    c4    c5    c6    c7    c8    c9   c10
r1    0.0   NaN   NaN   3.0   NaN   NaN   6.0   NaN   NaN   9.0
r2    NaN   NaN  12.0   NaN   NaN  15.0   NaN   NaN  18.0   NaN
r3    NaN  21.0   NaN   NaN  24.0   NaN   NaN  27.0   NaN   NaN
r4   30.0   NaN   NaN  33.0   NaN   NaN  36.0   NaN   NaN  39.0
r5    NaN   NaN  42.0   NaN   NaN  45.0   NaN   NaN  48.0   NaN
r6    NaN  51.0   NaN   NaN  54.0   NaN   NaN  57.0   NaN   NaN
r7   60.0   NaN   NaN  63.0   NaN   NaN  66.0   NaN   NaN  69.0
r8    NaN   NaN  72.0   NaN   NaN  75.0   NaN   NaN  78.0   NaN
r9    NaN  81.0   NaN   NaN  84.0   NaN   NaN  87.0   NaN   NaN
r10  90.0   NaN   NaN  93.0   NaN   NaN  96.0   NaN   NaN  99.0

In [46]:
b_m = df['c1'] > 11

In [47]:
df

     c1  c2  c3  c4  c5  c6  c7  c8  c9  c10
r1    0   1   2   3   4   5   6   7   8    9
r2   10  11  12  13  14  15  16  17  18   19
r3   20  21  22  23  24  25  26  27  28   29
r4   30  31  32  33  34  35  36  37  38   39
r5   40  41  42  43  44  45  46  47  48   49
r6   50  51  52  53  54  55  56  57  58   59
r7   60  61  62  63  64  65  66  67  68   69
r8   70  71  72  73  74  75  76  77  78   79
r9   80  81  82  83  84  85  86  87  88   89
r10  90  91  92  93  94  95  96  97  98   99

In [48]:
df[b_m]

     c1  c2  c3  c4  c5  c6  c7  c8  c9  c10
r3   20  21  22  23  24  25  26  27  28   29
r4   30  31  32  33  34  35  36  37  38   39
r5   40  41  42  43  44  45  46  47  48   49
r6   50  51  52  53  54  55  56  57  58   59
r7   60  61  62  63  64  65  66  67  68   69
r8   70  71  72  73  74  75  76  77  78   79
r9   80  81  82  83  84  85  86  87  88   89
r10  90  91  92  93  94  95  96  97  98   99

In [49]:
result = df[df['c1'] > 11]

In [50]:
result

     c1  c2  c3  c4  c5  c6  c7  c8  c9  c10
r3   20  21  22  23  24  25  26  27  28   29
r4   30  31  32  33  34  35  36  37  38   39
r5   40  41  42  43  44  45  46  47  48   49
r6   50  51  52  53  54  55  56  57  58   59
r7   60  61  62  63  64  65  66  67  68   69
r8   70  71  72  73  74  75  76  77  78   79
r9   80  81  82  83  84  85  86  87  88   89
r10  90  91  92  93  94  95  96  97  98   99

In [51]:
df[df['c1'] > 11][['c1', 'c3', 'c4']]

     c1  c3  c4
r3   20  22  23
r4   30  32  33
r5   40  42  43
r6   50  52  53
r7   60  62  63
r8   70  72  73
r9   80  82  83
r10  90  92  93

In [52]:
df[df['c1'] > 11].loc[['r3', 'r4']]

    c1  c2  c3  c4  c5  c6  c7  c8  c9  c10
r3  20  21  22  23  24  25  26  27  28   29
r4  30  31  32  33  34  35  36  37  38   39

In [53]:
df[df['c1'] == 70]

    c1  c2  c3  c4  c5  c6  c7  c8  c9  c10
r8  70  71  72  73  74  75  76  77  78   79

In [54]:
df[(df['c1']>60) & (df['c2']>80)]

     c1  c2  c3  c4  c5  c6  c7  c8  c9  c10
r9   80  81  82  83  84  85  86  87  88   89
r10  90  91  92  93  94  95  96  97  98   99

In [55]:
df

     c1  c2  c3  c4  c5  c6  c7  c8  c9  c10
r1    0   1   2   3   4   5   6   7   8    9
r2   10  11  12  13  14  15  16  17  18   19
r3   20  21  22  23  24  25  26  27  28   29
r4   30  31  32  33  34  35  36  37  38   39
r5   40  41  42  43  44  45  46  47  48   49
r6   50  51  52  53  54  55  56  57  58   59
r7   60  61  62  63  64  65  66  67  68   69
r8   70  71  72  73  74  75  76  77  78   79
r9   80  81  82  83  84  85  86  87  88   89
r10  90  91  92  93  94  95  96  97  98   99

In [56]:
df.reset_index(inplace=True)

In [57]:
df

  index  c1  c2  c3  c4  c5  c6  c7  c8  c9  c10
0    r1   0   1   2   3   4   5   6   7   8    9
1    r2  10  11  12  13  14  15  16  17  18   19
2    r3  20  21  22  23  24  25  26  27  28   29
3    r4  30  31  32  33  34  35  36  37  38   39
4    r5  40  41  42  43  44  45  46  47  48   49
5    r6  50  51  52  53  54  55  56  57  58   59
6    r7  60  61  62  63  64  65  66  67  68   69
7    r8  70  71  72  73  74  75  76  77  78   79
8    r9  80  81  82  83  84  85  86  87  88   89
9   r10  90  91  92  93  94  95  96  97  98   99

In [58]:
new_ind = 'a b c d e f g h i j'.split()
new_ind

['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [59]:
df['new_ind'] = new_ind
df

  index  c1  c2  c3  c4  c5  c6  c7  c8  c9  c10 new_ind
0    r1   0   1   2   3   4   5   6   7   8    9       a
1    r2  10  11  12  13  14  15  16  17  18   19       b
2    r3  20  21  22  23  24  25  26  27  28   29       c
3    r4  30  31  32  33  34  35  36  37  38   39       d
4    r5  40  41  42  43  44  45  46  47  48   49       e
5    r6  50  51  52  53  54  55  56  57  58   59       f
6    r7  60  61  62  63  64  65  66  67  68   69       g
7    r8  70  71  72  73  74  75  76  77  78   79       h
8    r9  80  81  82  83  84  85  86  87  88   89       i
9   r10  90  91  92  93  94  95  96  97  98   99       j

In [60]:
df.set_index('new_ind', inplace=True)
df

        index  c1  c2  c3  c4  c5  c6  c7  c8  c9  c10
new_ind
a          r1   0   1   2   3   4   5   6   7   8    9
b          r2  10  11  12  13  14  15  16  17  18   19
c          r3  20  21  22  23  24  25  26  27  28   29
d          r4  30  31  32  33  34  35  36  37  38   39
e          r5  40  41  42  43  44  45  46  47  48   49
f          r6  50  51  52  53  54  55  56  57  58   59
g          r7  60  61  62  63  64  65  66  67  68   69
h          r8  70  71  72  73  74  75  76  77  78   79
i          r9  80  81  82  83  84  85  86  87  88   89
j         r10  90  91  92  93  94  95  96  97  98   99

In [61]:
df.head(2)

        index  c1  c2  c3  c4  c5  c6  c7  c8  c9  c10
new_ind
a          r1   0   1   2   3   4   5   6   7   8    9
b          r2  10  11  12  13  14  15  16  17  18   19

In [62]:
df.tail(3)

        index  c1  c2  c3  c4  c5  c6  c7  c8  c9  c10
new_ind
h          r8  70  71  72  73  74  75  76  77  78   79
i          r9  80  81  82  83  84  85  86  87  88   89
j         r10  90  91  92  93  94  95  96  97  98   99

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 11 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   index   10 non-null     object
 1   c1      10 non-null     int64
 2   c2      10 non-null     int64
 3   c3      10 non-null     int64
 4   c4      10 non-null     int64
 5   c5      10 non-null     int64
 6   c6      10 non-null     int64
 7   c7      10 non-null     int64
 8   c8      10 non-null     int64
 9   c9      10 non-null     int64
 10  c10     10 non-null     int64
dtypes: int64(10), object(1)
memory usage: 960.0+ bytes

In [64]:
df.describe()

,c1,c2,c3,c4,c5,c6,c7,c8,c9,c10
count,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000,10.000000
mean,45.000000,46.000000,47.000000,48.000000,49.000000,50.000000,51.000000,52.000000,53.000000,54.000000
std,30.276504,30.276504,30.276504,30.276504,30.276504,30.276504,30.276504,30.276504,30.276504,30.276504
min,0.000000,1.000000,2.000000,3.000000,4.000000,5.000000,6.000000,7.000000,8.000000,9.000000
25%,22.500000,23.500000,24.500000,25.500000,26.500000,27.500000,28.500000,29.500000,30.500000,31.500000
50%,45.000000,46.000000,47.000000,48.000000,49.000000,50.000000,51.000000,52.000000,53.000000,54.000000
75%,67.500000,68.500000,69.500000,70.500000,71.500000,72.500000,73.500000,74.500000,75.500000,76.500000
max,90.000000,91.000000,92.000000,93.000000,94.000000,95.000000,96.000000,97.000000,98.000000,99.000000

## Pandas Hierarchical Indexing

In [67]:
index = [['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],[1, 2, 3, 1, 2, 3, 1, 2, 1, 2]]

In [69]:
index

[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
 [1, 2, 3, 1, 2, 3, 1, 2, 1, 2]]

In [70]:
ser = pd.Series(np.random.randn(10), index=index)
ser

a  1    0.174333
   2   -0.486447
   3   -2.041859
b  1   -0.220884
   2    2.059735
   3   -1.204626
c  1    0.593161
   2   -0.783139
d  1   -1.292409
   2    2.839524
dtype: float64

In [72]:
ser['a'][2]

-0.4864474426196919

In [78]:
df = pd.DataFrame(np.arange(12).reshape((4,3)), index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]], columns=['AB', 'ON', 'BC'])
df

     AB  ON  BC
a 1   0   1   2
  2   3   4   5
b 1   6   7   8
  2   9  10  11

In [79]:
df['AB']

a  1    0
   2    3
b  1    6
   2    9
Name: AB, dtype: int64

In [82]:
df.loc['a']

   AB  ON  BC
1   0   1   2
2   3   4   5

In [83]:
df.loc['a'].loc[2]['BC']

5

In [84]:
df.index.names

FrozenList([None, None])

In [85]:
df.index.names = ['L1', 'L2']

In [86]:
df.index.names

FrozenList(['L1', 'L2'])

In [88]:
df

       AB  ON  BC
L1 L2
a  1    0   1   2
   2    3   4   5
b  1    6   7   8
   2    9  10  11

In [89]:
df.xs('a')

    AB  ON  BC
L2
1    0   1   2
2    3   4   5

In [91]:
df.xs(key=1, level='L2')

    AB  ON  BC
L1
a    0   1   2
b    6   7   8

## Pandas Handling Missing Data

In [92]:
data_dic = {
    'A': [1, 2, np.nan, 4, np.nan],
    'B': [np.nan, np.nan, np.nan, np.nan, np.nan],
    'C': [11, 12, 13, 14, 15],
    'D': [16, np.nan, 18, 19, 20]
}

In [93]:
df = pd.DataFrame(data_dic)
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [98]:
df.isnull()

       A     B      C      D
0  False  True  False  False
1  False  True  False   True
2   True  True  False  False
3  False  True  False  False
4   True  True  False  False

In [99]:
df.notnull()

       A      B     C      D
0   True  False  True   True
1   True  False  True  False
2  False  False  True   True
3   True  False  True   True
4  False  False  True   True

In [96]:
df['A'].sum()

7.0

In [105]:
df['A'].mean()

2.3333333333333335

In [106]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [113]:
df.dropna(axis=1, thresh=4)

    C     D
0  11  16.0
1  12   NaN
2  13  18.0
3  14  19.0
4  15  20.0

In [118]:
df.fillna(value=df['A'].mean())

          A         B   C          D
0  1.000000  2.333333  11  16.000000
1  2.000000  2.333333  12   2.333333
2  2.333333  2.333333  13  18.000000
3  4.000000  2.333333  14  19.000000
4  2.333333  2.333333  15  20.000000

In [120]:
df.fillna(method='bfill')

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12  18.0
2  4.0 NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

## Data Wrangling, Combining, Merging, Joining

In [121]:
d1 = {'key': ['a', 'b', 'c', 'd', 'e'], 'A1': range(5), 'B1': range(5, 10)}
d2 = {'key': ['a', 'b', 'c'], 'A2': range(3), 'B2': range(3, 6)}

In [124]:
d1

{'key': ['a', 'b', 'c', 'd', 'e'], 'A1': range(0, 5), 'B1': range(5, 10)}

In [125]:
df1 = pd.DataFrame(d1)
df2 = pd.DataFrame(d2)

In [128]:
df1

  key  A1  B1
0   a   0   5
1   b   1   6
2   c   2   7
3   d   3   8
4   e   4   9

In [129]:
df2

  key  A2  B2
0   a   0   3
1   b   1   4
2   c   2   5

In [132]:
pd.merge(df1, df2, how='inner', on='key')

  key  A1  B1  A2  B2
0   a   0   5   0   3
1   b   1   6   1   4
2   c   2   7   2   5

In [133]:
pd.merge(df1, df2, how='outer', on='key')

  key  A1  B1   A2   B2
0   a   0   5  0.0  3.0
1   b   1   6  1.0  4.0
2   c   2   7  2.0  5.0
3   d   3   8  NaN  NaN
4   e   4   9  NaN  NaN

In [134]:
pd.merge(df1, df2, how='left', on='key')

  key  A1  B1   A2   B2
0   a   0   5  0.0  3.0
1   b   1   6  1.0  4.0
2   c   2   7  2.0  5.0
3   d   3   8  NaN  NaN
4   e   4   9  NaN  NaN

In [135]:
pd.merge(df1, df2, how='right', on='key')

  key  A1  B1  A2  B2
0   a   0   5   0   3
1   b   1   6   1   4
2   c   2   7   2   5

In [141]:
df_merge = pd.merge(df1, df2, how='outer', on='key')

In [143]:
df_merge.dropna(axis=1)

  key  A1  B1
0   a   0   5
1   b   1   6
2   c   2   7
3   d   3   8
4   e   4   9

In [144]:
left = pd.DataFrame({'key1': ['a', 'a', 'b', 'c'],
                    'key2': ['a', 'b', 'a', 'b'],
                    'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3']})
left

  key1 key2   A   B
0    a    a  A0  B0
1    a    b  A1  B1
2    b    a  A2  B2
3    c    b  A3  B3

In [145]:
right = pd.DataFrame({'key1': ['a', 'b', 'b', 'c'],
                    'key2': ['a', 'b', 'a', 'a'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']})
right

  key1 key2   C   D
0    a    a  C0  D0
1    b    b  C1  D1
2    b    a  C2  D2
3    c    a  C3  D3

In [147]:
pd.merge(left, right, how='inner', on=['key1', 'key2'])

  key1 key2   A   B   C   D
0    a    a  A0  B0  C0  D0
1    b    a  A2  B2  C2  D2

In [148]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0    a    a   A0   B0   C0   D0
1    a    b   A1   B1  NaN  NaN
2    b    a   A2   B2   C2   D2
3    c    b   A3   B3  NaN  NaN
4    b    b  NaN  NaN   C1   D1
5    c    a  NaN  NaN   C3   D3

In [149]:
pd.merge(left, right, how='left', on=['key1', 'key2'])

  key1 key2   A   B    C    D
0    a    a  A0  B0   C0   D0
1    a    b  A1  B1  NaN  NaN
2    b    a  A2  B2   C2   D2
3    c    b  A3  B3  NaN  NaN

In [150]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0    a    a   A0   B0  C0  D0
1    b    b  NaN  NaN  C1  D1
2    b    a   A2   B2  C2  D2
3    c    a  NaN  NaN  C3  D3

In [152]:
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3'],
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3']
}, index=[0, 1, 2, 3])

In [153]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [169]:
df2 = pd.DataFrame({
    'A': ['A4', 'A5', 'A6', 'A7'],
    'B': ['B4', 'B5', 'B6', 'B7'],
    'C': ['C4', 'C5', 'C6', 'C7'],
    'D': ['D4', 'D5', 'D6', 'D7']
}, index=[4, 5, 6, 7])

In [166]:
df2

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [170]:
pd.concat([df1, df2])

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [171]:
pd.concat([df1, df2], axis=1)

     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7